
** IDL
:PROPERTIES:
:header-args:bash: :session *PROMICE-AWS-processing-shell* :results verbatim
:END:

See [[file:IDL/README.org]], or code below

Can run IDL or GDL code interactively in Org mode even though it isn't officially supported. See for example the following (and =header-args:bash:= above in the =:PROPERTIES:= drawer.

#+BEGIN_SRC bash
print, "hello, world"
print, "goodbye"
#+END_SRC

#+RESULTS:
: hello, world
: goodbye

Run IDL code below after tangling to =pap.pro=
#+BEGIN_SRC bash
cd IDL
gdl
.com AWSdataprocessing_v3.pro
AWSdataprocessing_v3
#+END_SRC

#+RESULTS:

